Revit 2027 API
RebarSpliceByRulesResult.GetSpliceGeometries Method
 Gets the RebarSpliceGeometry collection which is the result of the splice by rules operation.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<RebarSpliceGeometry> GetSpliceGeometries()
Public Function GetSpliceGeometries As IList(Of RebarSpliceGeometry)
public:
IList<RebarSpliceGeometry^>^ GetSpliceGeometries()
member GetSpliceGeometries : unit -> IList<RebarSpliceGeometry>
Return Value
IList<RebarSpliceGeometry>
 Returns the RebarSpliceGeometry collection which is the result of the splice by rules operation.
See Also
Reference
RebarSpliceByRulesResult Class
Autodesk.Revit.DB.Structure Namespace